desafio-prog/app/controllers/vendas_controller.rb

  def index
    @vendas = Venda.all
---
SELECT  sum(vendas.preco_item*vendas.qtde_compra) as rb_resultado FROM "vendas"  ORDER BY "vendas"."id" ASC LIMIT 1
SELECT "vendas".* FROM "vendas"

  def create
    @venda = Venda.new(venda_params)

    respond_to do |format|
      if @venda.save
---
INSERT INTO "vendas" ("nome_comprador", "descricao_item", "preco_item", "qtde_compra", "endereco_vendedor", "nome_vendedor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @venda.destroy
---
DELETE FROM "vendas" WHERE "vendas"."id" = ?  [["id", 2]]

    def set_venda
      @venda = Venda.find(params[:id])
---
SELECT  "vendas".* FROM "vendas" WHERE "vendas"."id" = ? LIMIT 1  [["id", 4]]